app/controllers/cardtable_controller.rb

  def setupgame

    # Delete any records that are in the table. Even if we have deleted them
    # after each game, the player may start a new game without finishing a
    # previous game normally, i.e. by repeatedly selecting "Start New..."
    Cardtable.delete_all
---
DELETE FROM "cardtables" WHERE 1=1